#pragma once

#include <string>

namespace Fq4Editor
{

std::wstring RoleList[] = {
    L"國王", L"勇士", L"王子", L"銀騎士", L"法師", L"國王", L"國王", L"學者",
    L"指揮官", L"阿瑪族", L"驅魔者", L"護士", L"學者", L"魔女", L"怪獸人", L"軍師",
    L"學者", L"學者", L"僧侶", L"修道士", L"尼僧", L"魔女", L"店魔女", L"兄弟",
    L"兄弟", L"騎士", L"王子", L"小偷", L"忍者", L"國王", L"大魔頭", L"四天王",
    L"四天王", L"四天王", L"四天王", L"國王", L"王子", L"國王", L"探查機", L"國王",
    L"黑騎士", L"次公爵", L"公爵", L"紅戰士", L"死靈", L"魔頭", L"紅公爵", L"野武士",
    L"攻擊手", L"黑騎士", L"紅騎士", L"暗戰士", L"劍士", L"騎士", L"隊員", L"紅戰士",
    L"弓騎士", L"Ｂ士兵", L"Ｂ戰士", L"Ｂ弓兵", L"Ｍ雷母", L"Ｉ雷母", L"Ｃ雷母", L"國王",
    L"學者", L"製圖家", L"勇士", L"紅騎士", L"Ｒ士兵", L"Ｒ弓兵", L"王子", L"王子",
    L"普騎士", L"白戰士", L"騎士", L"槍兵", L"誘導槍", L"國王", L"皇后", L"學者",
    L"詩人", L"綠騎士", L"Ｇ士兵", L"Ｇ戰士", L"士兵", L"戰士", L"騎士", L"狙擊手",
    L"弓箭手", L"塔奧", L"瑪地普", L"依夫利", L"琴", L"天使", L"死靈", L"鬼神",
    L"還魂", L"骸骨", L"鬼", L"哥布林", L"林學士", L"鳥人", L"歐格", L"歐格",
    L"鱷魚", L"大鱷魚", L"狼人", L"熊人", L"精靈王", L"精靈", L"精靈", L"大精靈",
    L"靈魔女", L"鳥人", L"鳥弓", L"鳥騎士", L"國王", L"海盜", L"大海盜", L"公爵",
    L"克學士", L"槍學士", L"守衛", L"水之王", L"地之王", L"風之王", L"溫蒂", L"土精靈",
    L"西魯", L"土精靈", L"靈媒", L"特拉斯", L"國王", L"狼族", L"勇士", L"學士",
    L"狩獵者", L"虎族", L"熊貓", L"烏龜族", L"恐龍族", L"人面鷲", L"灰甲", L"大進",
    L"戰鬥機", L"盜賊", L"刀人", L"淑人", L"海獸", L"蜈蚣", L"工龍", L"伊古特",
    L"螃蟹", L"蠍子", L"米粘", L"雷斯坦", L"哈查斯", L"老鼠", L"公雞", L"蝸牛",
    L"蝸牛", L"蛇", L"山貓", L"小恐龍", L"天使", L"人造人", L"香菇", L"大老鼠",
    L"蜥蜴", L"海龍", L"海龍", L"海龍", L"食人花", L"食人花", L"石像", L"水晶球",
    L"花", L"陷阱", L"大砲", L"滿依達", L"飛龍", L"飛龍", L"人造人", L"射出機",
    L"薩伊達", L"伊比魯", L"黑爵士", L"黑騎士", L"馬騎士", L"怪物", L"古蜻蜓", L"國王",
    L"騎兵", L"騎士", L"騎士", L"誘導槍", L"王子", L"黑騎士", L"騎兵", L"飛龍",
    L"飛龍", L"飛龍", L"飛龍", L"特達羅", L"特達羅", L"特達羅", L"地獄獸", L"阿畢士",
    L"小雞", L"吸血鬼", L"伊比魯", L"克利風", L"巨人", L"攻雷姆", L"飛龍", L"克利風",
    L"龍騎兵", L"吸寫鬼", L"保護者", L"曼蒂可"
};

} // namespace Fq4Editor
